from django.http import HttpResponse
from django.shortcuts import render

blog_post = [
    {
        'title' : "ভালো শুরুর পরও বাংলাদেশ ২৫৬",
        'content': "ঊরুর চোটের কারণে ম্যাচটা খেলছেন না সাকিব আল হাসান। তাতে বিশ্বকাপের মঞ্চে বাংলাদেশ দলকে নেতৃত্ব দেওয়ার সুযোগ আসে নাজমুল হোসেনের। পুনের ব্যাটিং স্বর্গে টস ভাগ্য গেছে তাঁর পক্ষেই। কিন্তু আগে ব্যাটিংয়ের সিদ্ধান্ত নেওয়া বাংলাদেশ মহারাষ্ট্র ক্রিকেট অ্যাসোসিয়েশন স্টেডিয়ামের ব্যাটিং কন্ডিশনের সুবিধা কতটা কাজে লাগাতে পারল, সে প্রশ্ন থেকেই যায়। উদ্বোধনী জুটিতে ১৪.৪ ওভারে ৯৩ রান পাওয়ার পরও বাংলাদেশ দলের ইনিংস যে যেতে পেরেছে  ৮ উইকেটে ২৫৬ রান পর্যন্তই।তানজিদ হাসান ও লিটন দাসে আজ ওপেনিংয়ে রান খরা কাটিয়েছে বাংলাদেশ। দুজনই ফিফটি করেছেন। তানজিদের ব্যাট থেকে আসে ৪৩ বলে ৫১ রানের ইনিংস। লিটন করেছেন ৮২ বলে দলের পক্ষে সর্বোচ্চ ৬৬ রান। শেষের দিকে মাহমুদউল্লাহর ব্যাট থেকে আসে ৩৬ বলে ৪৬ রান।",
        'author' : "লিটন",
        'post_create_date' : "১৯ অক্টোবর ২০২৩, ১৮: ৫৩",
    },

{
        'title' : "পাকিস্তানকে কোথায় উন্নতি করতে হবে, বললেন রিজওয়ান",
        'content': "বিশ্বকাপের শুরুটা দারুণ হয়েছিল পাকিস্তানের। হায়দরাবাদে নেদারল্যান্ডসের বিপক্ষে ৮১ রানে ও শ্রীলঙ্কার বিপক্ষে ৬ উইকেটে জিতেছিল পাকিস্তান। লঙ্কানদের দেওয়া ৩৪৫ রানের লক্ষ্য ছুঁয়ে বিশ্বকাপ ইতিহাসেরই সর্বোচ্চ রান তাড়া করে জয়ের রেকর্ড গড়েছিল বাবর আজমের দল। কিন্তু আহমেদাবাদে গত শনিবার চিরপ্রতিদ্বন্দ্বী ভারতের কাছে বাজেভাবে হেরে বড় ধাক্কা খেয়েছে পাকিস্তান। ওই হারের পর দেশটির সাবেক ক্রিকেটাররা বাবর–রিজওয়ানদের ব্যাপক সমালোচনায় মেতেছেন। যদিও এক হারেই সব শেষ হয়ে যায়নি পাকিস্তানের। ৪ পয়েন্ট নিয়ে তালিকার শীর্ষে চারে আছে তারা। তবে শ্রীলঙ্কার বিপক্ষে বোলারদের দেদারসে রান বিলানো আর ভারতের কাছে অবিশ্বাস্য ব্যাটিং ধস পরের ম্যাচের আগে পাকিস্তানের মাথাব্যথার কারণ হয়ে ওঠার কথা।",
        'author' : "রিজওয়ান",
        'post_create_date' : "১৯ অক্টোবর ২০২৩, ২০: ১১",
    }

]


def home (request):
    return render(request, 'blog/index.html', {'blog_post':blog_post})
    # return HttpResponse('Ashik Bin Sadi')

def About (request):
    return render(request, 'blog/about.html', {'title':"About Page"})
